Revit 2024 API
CircuitConnectionType Enumeration
 An enumerated type indicates the panel to panel connection type
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public enum CircuitConnectionType
Visual Basic
Public Enumeration CircuitConnectionType
Visual C++
public enum class CircuitConnectionType
Members
Member name | Description
NotApplicable |  NotApplicable.
Breaker |  Breaker.
FeedThruLugs |  FeedThruLugs.
See Also
Autodesk.Revit.DB.Electrical Namespace